tf-controller plan output:

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.example must be replaced
-/+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cd5968-tf-test" -> (known after apply)
      ~ bucket                      = "cd5968-tf-test" -> "cd5968-tf-test2" # forces replacement
      ~ bucket_domain_name          = "cd5968-tf-test.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "cd5968-tf-test.s3.eu-north-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BAZG2TWCNX0D" -> (known after apply)
      ~ id                          = "cd5968-tf-test" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "eu-north-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Name"     = "CD-5968"
            "TeamName" = "CD"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "a23de5480f46fda3431168b7b23c01ff77e4b35b50f96301dae9d26c2ee54fd5" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

To apply this plan, please **merge** this pull request.
